# GetCutPairOpenings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFamilyInstanceExtrusionExportResults..::..GetCutPairOpenings Method
IFCFamilyInstanceExtrusionExportResults Class See Also
---
Gets the set of "openings" determined from the analysis of the instance geometry.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<IFCExtrusionData> GetCutPairOpenings()
```

Visual Basic
---
```text
Public Function GetCutPairOpenings As IList(Of IFCExtrusionData)
```

Visual C++
---
```text
public:
IList<IFCExtrusionData^>^ GetCutPairOpenings()
```

# ### Return Value
The extra openings.
# See Also
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace